Конфигурация/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксНумерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Comment>Ранее этой даты проведение документов запрещено</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОтветственныхЗаОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПодтвержденийОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДоступаКСчетамДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиВФайловомХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Пользователи/Forms/ВыборТекущейОрганизации/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура УстановитьНовыеЗначенияПараметровСеанса(Организация, Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ТекущаяОрганизация								= Организация;
	ПараметрыСеанса.ТекущийПользователь								= Пользователь;
	ПараметрыСеанса.КонтрольДоступаКСчетамДоверительногоУправления	= Организация.КонтрольДоступаКСчетамДоверительногоУправления;
	
	РаботаСНормативноСправочнойИнформацией.УстановитьПараметрСеансаДоступныВсеСчетаДоверительногоУправления(Организация.КонтрольДоступаКСчетамДоверительногоУправления);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УстановитьТекущиеОрганизациюИПользователя

&НаСервереБезКонтекста
Функция ПолучитьТипОбъектовДляОповещения()
	
	ТипОбъектовДляОповещения = Новый Массив;
	
	Для каждого ОбъектМД Из Метаданные.Документы Цикл
		ТипОбъектовДляОповещения.Добавить(Тип("ДокументСсылка." + ОбъектМД.Имя));
	КонецЦикла;
	
	Для каждого ОбъектМД Из Метаданные.Справочники Цикл
		ТипОбъектовДляОповещения.Добавить(Тип("СправочникСсылка." + ОбъектМД.Имя));
	КонецЦикла;
	
	Для каждого ОбъектМД Из Метаданные.РегистрыСведений Цикл
		ТипОбъектовДляОповещения.Добавить(Тип("РегистрСведенийКлючЗаписи." + ОбъектМД.Имя));
	КонецЦикла;
	
	Для каждого ОбъектМД Из Метаданные.РегистрыНакопления Цикл
		ТипОбъектовДляОповещения.Добавить(Тип("РегистрНакопленияКлючЗаписи." + ОбъектМД.Имя));
	КонецЦикла;
	
	Для каждого ОбъектМД Из Метаданные.РегистрыБухгалтерии Цикл
		ТипОбъектовДляОповещения.Добавить(Тип("РегистрБухгалтерииКлючЗаписи." + ОбъектМД.Имя));
	КонецЦикла;
	
	Возврат ТипОбъектовДляОповещения;
	
КонецФункции // ПолучитьТипОбъектовДляОповещения

&НаСервереБезКонтекста
Процедура УстановитьОсновнуюОрганизацию(НоваяОсновнаяОрганизация)
	
	ИдТекущегоПользователя = РаботаСПользователями.ТекущийПользователь().ИдентификаторПользователяИБ;
	
	// получим текущее состояние и изменим его в соответствии с новыми требованиями
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Организация КАК Организация,
		|	Пользователи.Основной КАК Основной,
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И Пользователи.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И НЕ Пользователи.ВходЗапрещен";
		
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", РаботаСПользователями.ТекущийПользователь().ИдентификаторПользователяИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	// установим блокировку
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Пользователи");
	ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторПользователяИБ", ИдТекущегоПользователя);
	
	БлокировкаДанных.Заблокировать();
	
	// 1-м проходом сброим старый вариант
	Пока Выборка.Следующий() Цикл
		Если Выборка.Основной И Выборка.Организация <> НоваяОсновнаяОрганизация Тогда
			Пользователь = Выборка.Ссылка.ПолучитьОбъект();
			Пользователь.Основной = Ложь;
			Пользователь.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// 2-м проходом установим новую основную организацию
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Организация = НоваяОсновнаяОрганизация И Не Выборка.Основной Тогда
			Пользователь = Выборка.Ссылка.ПолучитьОбъект();
			Пользователь.Основной = Истина;
			Пользователь.Записать();
		КонецЕсли;
	КонецЦикла;	
		
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // УстановитьОсновнуюОрганизацию

&НаСервере
Процедура ОбновитьДоступныеОрганизацииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(Пользователи.Организация) КАК ОрганизацияНаименование,
		|	Пользователи.Организация.ПрефиксНумерации КАК Префикс,
		|	Пользователи.Основной КАК Основная,
		|	Пользователи.Ссылка КАК Пользователь,
		|	ПРЕДСТАВЛЕНИЕ(Пользователи.Ссылка) КАК ПользовательНаименование,
		|	ВЫБОР
		|		КОГДА Пользователи.Организация = &ТекущаяОрганизация
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Текущая
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И Пользователи.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И НЕ Пользователи.ВходЗапрещен";
		
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", РаботаСПользователями.ТекущийПользователь().ИдентификаторПользователяИБ);
	Запрос.УстановитьПараметр("ТекущаяОрганизация",          ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
		
	ЭтаФорма.ДоступныеОрганизации.Загрузить(
		Запрос.Выполнить().Выгрузить());
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОбновитьДоступныеОрганизацииНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаКомандаУстановитьОсновной.Видимость = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	ОбновитьДоступныеОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОрганизацииПередНачаломИзменения(Элемент, Отказ)
	
	КомандаВыбрать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ТекущиеДанные = Элементы.ДоступныеОрганизации.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыеЗначенияПараметровСеанса(ТекущиеДанные.Организация, ТекущиеДанные.Пользователь);
	
	УстановитьЗаголовокКлиентскогоПриложения(РаботаСФормамиКлиент.СформироватьЗаголовокПриложения());
	
	Для каждого ИзмененныйТип Из ПолучитьТипОбъектовДляОповещения() Цикл
		ОповеститьОбИзменении(ИзмененныйТип);
	КонецЦикла;
	
	Оповестить("Обработка.ЖурналыОпераций.Форма.Обновить");
	Оповестить("СчетаДоверительногоУправления.Обновить");
	
	ИменаЭлементовТабличныхДокументов = СтрРазделить(
		"Результат,ДокументРезультат,ТабличныйДокумент,ТаблицаОтчета,РезультатДоверительноеУправление,"
		+ "РезультатКлиентскаяБаза,Расшифровка,РезультатРасчетМинимальнойСтоимости,РезультатСЧА,Расхождения,"
		+ "РезультатБалансоваяСтоимостьЮрЛиц,РезультатСтоимостьФЛ,ОтчетТабличныйДокумент", ",", Ложь);
	
	Для Каждого ТекОкно Из ПолучитьОкна() Цикл
		
		Для Каждого Форма Из ТекОкно.Содержимое Цикл
			
			Если ТипЗнч(Форма) <> Тип("УправляемаяФорма") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНачинаетсяС(Форма.ИмяФормы, "ВнешнийОтчет") ИЛИ СтрНачинаетсяС(Форма.ИмяФормы, "Отчет") Тогда
				
				Если Не СтрНачинаетсяС(Форма.ИмяФормы, "Отчет.РегламентированныйОтчет") Тогда
					
					Попытка
						Форма.ПриСменеТекущейОрганизации(); // если в форме определен экспортный обработчик ПриСменеТекущейОрганизации(), все действия выполняем в нем
					Исключение
						
						// иначе начинаем перебирать варианты
						
						Попытка
							Форма.Отчет.Организация = ТекущиеДанные.Организация;
						Исключение
						КонецПопытки;
						
						Попытка
							Форма.Отчет.СчетДоверительногоУправления = Неопределено;
						Исключение
						КонецПопытки;
						
						Попытка
							Форма.Организация = ТекущиеДанные.Организация;
						Исключение
						КонецПопытки;
						
						Попытка
							Форма.СчетДоверительногоУправления = Неопределено;
						Исключение
						КонецПопытки;
						
						Для каждого ИмяЭлемента Из ИменаЭлементовТабличныхДокументов Цикл
							ЭлементТабДок = Форма.Элементы.Найти(ИмяЭлемента);
							Если ЭлементТабДок <> Неопределено Тогда
								РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭлементТабДок, "НЕАКТУАЛЬНОСТЬ");
							КонецЕсли; 
						КонецЦикла;
						
						РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(Форма, ТекущиеДанные.Организация);					
						
					КонецПопытки;

				КонецЕсли;					
				
			Иначе
				
				Попытка
					Форма.ПриСменеТекущейОрганизации(); // если в форме определен экспортный обработчик ПриСменеТекущейОрганизации(), все действия выполняем в нем
				Исключение
				КонецПопытки;
				
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	
	ЭтаФорма.Закрыть(ТекущиеДанные.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОсновной(Команда)
	
	Если Элементы.ДоступныеОрганизации.ТекущиеДанные = Неопределено Тогда // такого быть не должно, но на всякий случай защитимся
		Возврат;
	КонецЕсли;
	
	НоваяОсновнаяОрганизация = Элементы.ДоступныеОрганизации.ТекущиеДанные.Организация;
	
	Если Вопрос("Установить организацию '" + НоваяОсновнаяОрганизация + "' основной? Она будет использоваться по-умолчанию при следующих входах в систему.", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОсновнуюОрганизацию(НоваяОсновнаяОрганизация);
	
	КлючТекущейСтрокиДоступныхОрганизаций = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.ДоступныеОрганизации, "Организация");
	
	ОбновитьДоступныеОрганизацииНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ДоступныеОрганизации, Элементы.ДоступныеОрганизации, "Организация", КлючТекущейСтрокиДоступныхОрганизаций);
	
КонецПроцедуры
